"""
Определяет словари, описывающие положение объектов на формах
"""


"""
key -> (label_config, entry_config)
"""
activity_record_edit = {
    'actor_name': (
        {'text': 'Имя:', 'x': 50, 'y': 50},
        {'x': 200, 'y': 50}
    ),
    'actor_year_of_birth': (
        {'text': 'Год рождения:', 'x': 50, 'y': 80},
        {'x': 200, 'y': 80}
    ),
    'actor_country': (
        {'text': 'Страна', 'x': 50, 'y': 110},
        {'x': 200, 'y': 110}
    ),
    'actor_played_movies': (
        {'text': 'Количество фильмов:', 'x': 50, 'y': 140},
        {'x': 200, 'y': 140}
    ),
    'movie_name': (
        {'text': 'Самый популярный фильм', 'x': 50, 'y': 170},
        {'x': 200, 'y': 170}
    ),
    'movie_score': (
        {'text': 'Оценка фильма:', 'x': 50, 'y': 200},
        {'x': 200, 'y': 200}
    )
}
